{
    "common": {
        "drawer": {
            "home": "Ana Sayfa",
            "about": "Hakkımda",
            "web_site": "Web sitesi Oluşturma Adımları",
            "git": "Git Notları"
        }
    },
    "about":{
        "header_about": "Hakkımda",
        "header_interests": "İlgi Alanlarım",
        "about_content": "26 Eylül 1996 yılında İstanbul'un Beyoğlu ilçesinde dünyaya geldim, 5 kişilik bir ailenin en küçük oğluyum. İlerleyen dönemde çok geçmeden şehrin dışında bulunan Büyükçekmece ilçesinin Sinanoba semtine taşındık. Oldukça sessiz, sakin ve düzenli yerleşimi olan güzel bir yerdi. İlk ve ortaokul eğitimimi semtimizde bulunan YalçınÇiftçioğlu İlköğertim okulunda tamamladım. Lisenin ilk 3 senesini şehrin oldukça dışında bulunan Gümüşyaka Anadolu Lisesi'nde son seneyi ise Büyükçekmece Anadolu Lisesi'nde tamamladım. Üniversite için Adana Çukurova Üniversitesi Elektrik Elektronik Mühendisliği bölümünü kazandım. Bu dönemde 4 aylık ABD'de Work and Travel deneyimim oldu. Mezuniyetim sonunda çevre ve enerji teknolojileri üzerine bir firmada işe başladım 7 aylık süreç sonunda yazılım sektörüne geçiş yaptım ve şu an halen Front End yazılım geliştirici olarak Etiya firmasında çalışmaktayım.",
        "interests_content": "Yüzme, Kayak, Kardiyo , Okuma, Motosiklet , Kamp , Puzzle"

    },
    "home": {
        "header": "Merhaba!",
        "content": "Kendim hakkımda bilgi vermek, hayatıma dair paylaşımlarda bulunmak ve bildiklerimi paylaşım yapmak için yayınladığım bu sitede, merak ettiklerinizi bulabilirsiniz."
    },
    "website": {
        "header": "Web Sitesi Oluşturma Temel Adımları",
        "main_content": "Hazır şablonlar üzerinden (wordpress, wix vb.) web sitesi oluşturma yöntemlerinden ziyade, burada bahsedeceğim konu bir Front-end kütüphanesi ile web sitesi geliştirip bunu nasıl yayınlayabileceğinizin temel adımlarını anlatacağım.",
        "first_content": "Kodlarımızı yazabilmemiz için bir IDE'ye ihtiyaç duyarız bunun için de en yaygın ve benim de kullandığım Visual Studio Code'u indirebiliriz.",
        "second_content": "Kodlarımızı yazarken bizlere kolaylık olsun diye kullanacağımız bazı araçlar (kütüphaneler) bulunmaktadır bunları projemize dahil etmek, güncellemek, kaldırmak ve bağımlılıkları yönetmek için npm (Node-Package-Manager)'e ihtiyaç duyarız. Kullanmak için Npm birlikte paketlendiklerinden dolayı nodejs yüklememiz gerekmektedir. ",
        "third_content": "Bu adımda artık kodumuzu yazacağımız önyüz framework'ünü seçmek var, kendim Vuejs kullanıyorum fakat daha bir çok seçenekte bulunmakta React, Angular vb.",
        "fourth_content": "Framework'ü derlememiz için onun GLI 'da indirmemiz gerekiyor.",
        "fifth_content": "Artık projemize başlayabiliriz, terminalden (başlat kısmına cmd yazarak erişilebilir) 'vue create proje-adi' yazarak vue projemizi oluşturmaya başlayabiliriz.",
        "sixth_content": "Npm kullanacağımız yer burası, işlerimizi kolaylaştırmak ve sitemize özellikler eklemek için npm ile görsel kütüphane (Vuetify, bootstrap, tailwindcss vb.), dil kütüphanesi (i18n), CSS ön işlemcisi SASS vb. kütüphaneleri yükleriz.",
        "seventh_content": "Yaptığımız geliştirmeleri adım adım takip edebilmek, yeri geldiğinde inceleyip, geriye dönüp önceki hallerine bakmak, başkaları ile paylaşmak için GitHub, BitBucket gibi versiyon kontrol sisteminden birinde hesap açıp geliştirmelerimizi buraya yükleyebiliriz. Bunun için commit, branch, pull-push, pull-request gibi kavramlara göz atmanızı tavsiye ederim.",
        "eighth_content": "Projemizi tamamladıktan sonra bir paket oluştururuz. Peki nedir bu paket? Kodlarımız dolayısıyla da web sitemiz şu ana kadar kendi local'imizde çalışıyor fakat biz bunu sadece kendimiz görelim diye yapmadık:). Bunun için bu kodları bir yere yüklememiz ve insanlarla bir link üzerinden bu siteyi paylaşabiliyor olmalıyız. Yalnız paket ne? Bizim tarayıcımız Angular, React, Vuejs anlamaz! Onun anlayacağı tek şey Javascript, HTML, CSS'dir. Bizler 'npm run build' komutu ile bu yazdığımız kodları bir js, css ve index.html ile sonradan eklediğimiz favicon ve imageler içeren dist adında bir klasör (paket) oluştururuz.",
        "nineth_content": "Bu oluşturulan dist klasörünü sunucu aldığımız yerde bize dosyalarımızı yönetmemiz için ayrılan alandaki htdocs altına yükleriz.",
        "tenth_content": "Eğer hosting sağlayacımız altında sağlanan bir subdomain aldıysak, dosyaları yükledikten sonra ilgili URL tıklandığında sitemiz açılır. Eğer subdomain değilde dışarıdan bir domain aldıysak, host'umuz ve domain'imizin ilişkilendirilebilmesi için name server denilen bir kavram var. Host'a ait name server'ları domain'e yapıştırmamız gerekiyor. Yani name server’ları girerek host’umuz ile domain’imizin bağlantı işlemlerini gerçekleştirmiş oluyoruz köprüyü kuruyoruz. Bağlantı işlemini yaptıktan birkaç saat sonra işlem tamamlanıyor. Artık sitemiz hazır ve erişilebilir."
    },
    "git": {
        "header": "Sık Kullanılan Git Komutları",
        "first_content": "Versiyon Kontrolü",
        "second_content": "Bulunulan branch üzerinden atılan bütün commitleri listeler",
        "third_content": "Hangi branch'te bulunulduğunu gösterir",
        "fourth_content": "user isimli branch oluşturur",
        "fifth_content": "user isimli branch silinir.",
        "sixth_content": "user branch'ine geçiş yapar (dallanır)",
        "seventh_content": "Son değişiklikleri görüntüler",
        "eighth_content": "Mevcutta bulunan değişiklikleri locale'imizdeki stash dosyasına kaydeder ve istediğimiz zaman oradan çekebiliriz",
        "nineth_content": "Stash'te bulunan değişikliklerimizi listeler",
        "tenth_content": "Stash içerisindeki son değişikliği getirir",
        "eleventh_content": "Stash içerisindeki 0. index'teki değişikliği getirir ve onu listeden siler",
        "twelfth_content": "Stash içerisindeki 1. index'teki değişikliği getirmeden listeden siler",
        "thirteenth_content": "CommitID'si verilen commit'i yeni bir commit üreterek siler",
        "fourteenth_content": "HEAD ve sonrasındaki commitleri yeni commit üretmeden siler"
    }
}